unit_4/w12d01/homework/dating_app/dating_app_api/app/controllers/daters_controller.rb

SELECT "daters".* FROM "daters"
---
  def index
    @daters = Dater.all.sample(6)