unit_4/w11d05/instructor_examples/songs_app_api/app/controllers/songs_controller.rb

    def index
        render json: { status: 200, songs: Song.all }
---
SELECT "songs".* FROM "songs"

    def show
        puts params
        song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def create
        song = Song.new(song_params)

        if song.save
---
INSERT INTO "songs" ("title", "artist_name", "artwork") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Power"], ["artist_name", "Kanye"], ["artwork", "None"]]

    def update
        song = Song.find(params[:id])
        song.update(song_params)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "songs" SET "title" = $1, "artist_name" = $2, "artwork" = $3 WHERE "songs"."id" = $4  [["title", "Stronger"], ["artist_name", "Kanye"], ["artwork", "None"], ["id", 2]]

    def destroy
        song = Song.destroy(params[:id])
---
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 1]]